Revit 2026 API

# DGNExportOptionsSeedName Property

---

The name of the DGN seed. Default value of seedName is empty.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SeedName { get; set; }
```
```vb
Public Property SeedName As String
	Get
	Set
```
```cpp
public:
property String^ SeedName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SeedName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

DGNExportOptions Class

Autodesk.Revit.DB Namespace